0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1 0 0);

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    
    wall1out
    {
        type            noSlip; // shroud
    }
    
    wall1in
    {
        //type          hub;
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    
    
    ami2
    {
        type            cyclicAMI;
        value           $internalField;
    }
    
    wall2out
    {
        type            noSlip;
    }
    
    wall2in
    {
        type            noSlip;
    }
    
    ami1
    {
        type            cyclicAMI;
        value           $internalField;
    }
    
    inlet
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }
}


// ************************************************************************* //
