0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    ami1
    {
        type            cyclicAMI;
        value           $internalField;
    }
    wall2in
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    wall2out
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }    
    
    wall1in    // hub
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    
    wall1out   // shroud
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }    
        
    ami2
    {
        type            cyclicAMI;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
 

}


// ************************************************************************* //
