0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
       //type            zeroGradient;
        type            fixedValue;
        value           uniform 0;    
    
    }     
    wall1out
    {
        type            zeroGradient;
    }
    wall1in
    {
        type            zeroGradient;
    }
    ami2
    {
        type            cyclicAMI;
        value           $internalField;
    }
    wall2out
    {
        type            zeroGradient;
    }
    wall2in
    {
        type            zeroGradient;
    }
    ami1
    {
        type            cyclicAMI;
        value           $internalField;
    }
    inlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
